In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    "names" : ['John','Tom','Rob','Harry','Jack','Jeff','Sam'],
    "salary" : [45000,48000,19000,42000,25000,28000,34000],
    "dept" : ['IT','IT','HR','HR','IT','HR','IT']
}

In [3]:
pd.Series(data)

names              [John, Tom, Rob, Harry, Jack, Jeff, Sam]
salary    [45000, 48000, 19000, 42000, 25000, 28000, 34000]
dept                           [IT, IT, HR, HR, IT, HR, IT]
dtype: object

In [4]:
pd.Series(data['names'])

0     John
1      Tom
2      Rob
3    Harry
4     Jack
5     Jeff
6      Sam
dtype: object

In [6]:
df = pd.DataFrame(data)

In [8]:
df.shape

(7, 3)

In [10]:
# return first 5 rows by default
# df.head()
df.head(2)

  names  salary dept
0  John   45000   IT
1   Tom   48000   IT

In [12]:
# return last 5 rows by default
# df.tail()
df.tail(2)

  names  salary dept
5  Jeff   28000   HR
6   Sam   34000   IT

In [13]:
df['dept'] == 'IT'

0     True
1     True
2    False
3    False
4     True
5    False
6     True
Name: dept, dtype: bool

In [14]:
df[df['dept'] == 'IT']

  names  salary dept
0  John   45000   IT
1   Tom   48000   IT
4  Jack   25000   IT
6   Sam   34000   IT

In [15]:
# df[() | ()] -> or condition
# df[() & ()] -> and condition

df[(df['dept'] == 'IT') & (df['salary'] > 30000)]

  names  salary dept
0  John   45000   IT
1   Tom   48000   IT
6   Sam   34000   IT

In [17]:
df.loc[0]

names      John
salary    45000
dept         IT
Name: 0, dtype: object

In [18]:
df.loc[0:3]

   names  salary dept
0   John   45000   IT
1    Tom   48000   IT
2    Rob   19000   HR
3  Harry   42000   HR

In [21]:
df.iloc[:3,0:2]

  names  salary
0  John   45000
1   Tom   48000
2   Rob   19000